import folium
from folium import plugins

omsk_center = [54.9849, 73.3675]

m = folium.Map(location=omsk_center, zoom_start=14)


# Второй маршрут
route2_coordinates = [
    [54.988805897573826, 73.35776855796219],
    [54.98707331312102, 73.35946305415793],
    [54.98578057638505, 73.36072905672228],
    [54.985232689662965, 73.36238129745855],  # Тобольские ворота
    [54.98485101136889, 73.3625100434321],
    [54.982733246457244, 73.3667479335727],
    [54.982345387847886, 73.3696876345947],
    [54.98304722444167, 73.37623222450267],  # Речной порт
    [54.98303530878685, 73.37627748700253],
    [54.98217300504187, 73.3768544971324],
    [54.98188364655011, 73.37557776571124],
    [54.98158197269745, 73.37312086245107],
    [54.981194102977334, 73.37018116147911],
    [54.979678465867714, 73.37196875769673]
]

folium.PolyLine(
    route2_coordinates,
    weight=8,
    color='black',
    opacity=0.7,
    popup='Маршрут 2: Тобольские ворота - Статуя Петра I - Речной порт',
    dash_array='10,10'
).add_to(m)

# Добавляем маркеры для всех точек
locations = {
    'Начало': [54.988805897573826, 73.35776855796219],
    'Конец': [54.979678465867714, 73.37196875769673],
    'Тобольские ворота и Статуя Петру Первому': [54.985232689662965, 73.36238129745855],
    'Речной порт': [54.98252176044839, 73.37386797923476],
   #'RE`конструкция':[54.9850408703685, 73.36362582045356],
    #'Перцы':[54.98357143187311, 73.37518744294722],
    #'Метаморфозы':[54.98529575227004, 73.3798583282982]
}
locations = {
    'Начало': {
        'coords': [54.988805897573826, 73.35776855796219],
        'description': ''
    },
    'Тобольские ворота и Статуя Петру Первому': {
        'coords': [54.985232689662965, 73.36238129745855],
        'description': 'Исторические ворота Омской крепости, памятник архитектуры XVIII века'
    },
    'Речной порт': {
        'coords': [54.98252176044839, 73.37386797923476],
        'description': 'Омский речной вокзал на берегу реки Омки, важный траспортный узел'
    },
    'конец': {
        'coords': [54.979678465867714, 73.37196875769673],
        'description': ''
    },
}

for name, data in locations.items():
    # Создаем красивый popup с описанием
    popup_html = f"""
    <div style="min-width: 200px">
        <h4 style="margin: 0; color: #2c3e50;">{name}</h4>
        <hr style="margin: 5px 0;">
        <p style="margin: 0; font-size: 14px; color: #34495e;">{data['description']}</p>
    </div>
    """

    folium.Marker(
        data['coords'],
        popup=folium.Popup(popup_html, max_width=300),
        tooltip=f'Нажми для информации: {name}',
        icon=folium.Icon(color='red', icon='info-sign')
    ).add_to(m)

m.save('omsk_map.html')
print("Карта сохранена как 'omsk_map.html'")